Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: واذكر في الكتاب مريم إذ انتبذت من أهلها مكانا شرقيا
en: And mention in the Book (the Qur'an, O Muhammad صلى الله عليه وسلم the story of) Maryam (Mary), when she withdrew in seclusion from her family to a place facing east.

source: فاتخذت من دونهم حجابا فأرسلنا إليها روحنا فتمثل لها بشرا سويا
en: She placed a screen (to screen herself) from them; then We sent to her Our Ruh [angel Jibril (Gabriel)], and he appeared before her in the form of a man in all respects.

source: قالت إني أعوذ بالرحمن منك إن كنت تقيا
en: She said: "Verily! I seek refuge with the Most Gracious (Allah) from you, if you do fear Allah."

source: قال إنما أنا رسول ربك لأهب لك غلاما زكيا
en: (The angel) said: "I am only a messenger from your Lord, (to announce) to you the gift of a righteous son."

source: قالت أنى يكون لي غلام ولم يمسسني بشر ولم أك بغيا
en: She said: "How can I have a son, when no man has touched me, nor am I unchaste?"

source: قال كذلك قال ربك هو علي هين ولنجعله آية للناس ورحمة منا وكان أمرا مقضيا
en: He said: "So (it will be), your Lord said: 'That is easy for Me (Allah): And (We wish) to appoint him as a sign to mankind and a mercy from Us (Allah), and it is a matter (already) decreed, (by Allah).' "

source: فحملته فانتبذت به مكانا قصيا
en: So she conceived him, and she withdrew with him to a far place (i.e. Bethlehem valley about 4-6 miles from Jerusalem).

source: فأجاءها المخاض إلى جذع النخلة قالت يا ليتني مت قبل هذا وكنت نسيا منسيا
en: And the pains of childbirth drove her to the trunk of a date-palm. She said: "Would that I had died before this, and had been forgotten and out of sight!"

source: فناداها من تحتها ألا تحزني قد جعل ربك تحتك سريا
en: Then [the babe 'Îsa (Jesus) or Jibril (Gabriel)] cried unto her from below her, saying: "Grieve not: your Lord has provided a water stream under you.

source: وهزي إليك بجذع النخلة تساقط عليك رطبا جنيا
en: "And shake the trunk of date-palm towards you, it will let fall fresh ripe-dates upon you."

source: فكلي واشربي وقري عينا فإما ترين من البشر أحدا فقولي إني نذرت للرحمن صوما فلن أكلم اليوم إنسيا
en: "So eat and drink and be glad. And if you see any human being, say: 'Verily! I have vowed a fast unto the Most Gracious (Allah) so I shall not speak to any human being this day.'"

source: فأتت به قومها تحمله قالوا يا مريم لقد جئت شيئا فريا
en: Then she brought him (the baby) to her people, carrying him. They said: "O Mary! Indeed you have brought a thing Fariyy (a mighty thing). [Tafsir Al-Tabari]

source: يا أخت هارون ما كان أبوك امرأ سوء وما كانت أمك بغيا
en: "O sister (i.e. the like) of Harun (Aaron) ! Your father was not a man who used to commit adultery, nor your mother was an unchaste woman."

source: فأشارت إليه قالوا كيف نكلم من كان في المهد صبيا
en: Then she pointed to him. They said: "How can we talk to one who is a child in the cradle? "

source: قال إني عبد الله آتاني الكتاب وجعلني نبيا
en: "He ['Îsa (Jesus)] said: "Verily I am a slave of Allah, He has given me the Scripture and made me a Prophet; "

source: وجعلني مباركا أين ما كنت وأوصاني بالصلاة والزكاة ما دمت حيا
en: "And He has made me blessed wheresoever I be, and has enjoined on me Salat (prayer), and Zakat, as long as I live."

source: وبرا بوالدتي ولم يجعلني جبارا شقيا
en: "And dutiful to my mother, and made me not arrogant, unblest.

source: والسلام علي يوم ولدت ويوم أموت ويوم أبعث حيا
en: "And Salam (peace) be upon me the day I was born, and the day I die, and the day I shall be raised alive!"

source: ذلك عيسى ابن مريم قول الحق الذي فيه يمترون
en: Such is 'Îsa (Jesus), son of Maryam (Mary). (It is) a statement of truth, about which they doubt (or dispute).

source: ما كان لله أن يتخذ من ولد سبحانه إذا قضى أمرا فإنما يقول له كن فيكون
en: It befits not (the Majesty of) Allah that He should beget a son [this refers to the slander of Christians against Allah, by saying that 'Îsa (Jesus) is the son of Allah]. Glorified (and Exalted) be He (above all that they associate with Him). When He decrees a thing, He only says to it: "Be!" - and it is.

source: وإن الله ربي وربكم فاعبدوه هذا صراط مستقيم
en: ['Îsa (Jesus) said]: "And verily Allah is my Lord and your Lord. So worship Him (Alone). That is the Straight Path. (Allah's religion of Islamic Monotheism which He did ordain for all of His Prophets)." [Tafsir At-Tabari]

source: فاختلف الأحزاب من بينهم فويل للذين كفروا من مشهد يوم عظيم
en: Then the sects differed [i.e. the Christians about 'Îsa (Jesus) عليه السلام], so woe unto the disbelievers [those who gave false witness by saying that 'Îsa (Jesus) is the son of Allah] from the Meeting of a great Day (i.e. the Day of Resurrection, when they will be thrown in the blazing Fire) .

source: أسمع بهم وأبصر يوم يأتوننا لكن الظالمون اليوم في ضلال مبين
en: How clearly will they (polytheists and disbelievers in the Oneness of Allah) see and hear the Day when they will appear before Us! But the Zalimun (polytheists and wrong-doers) today are in plain error.

source: وأنذرهم يوم الحسرة إذ قضي الأمر وهم في غفلة وهم لا يؤمنون
en: And warn them (O Muhammad صلى الله عليه وسلم) of the Day of grief and regrets, when the case has been decided, while (now) they are in a state of carelessness, and they believe not .

source: إنا نحن نرث الأرض ومن عليها وإلينا يرجعون
en: Verily We will inherit the earth and whatsoever is thereon. And to Us they all shall be returned,

source: واذكر في الكتاب إبراهيم إنه كان صديقا نبيا
en: And mention in the Book (the Qur'an) Ibrahim (Abraham). Verily he was a man of truth, a Prophet.

source: إذ قال لأبيه يا أبت لم تعبد ما لا يسمع ولا يبصر ولا يغني عنك شيئا
en: When he said to his father: "O my father! Why do you worship that which hears not, sees not and cannot avail you in anything?

source: يا أبت إني قد جاءني من العلم ما لم يأتك فاتبعني أهدك صراطا سويا
en: "O my father! Verily there has come to me of the knowledge that which came not unto you. So follow me, I will guide you to the Straight Path.

source: يا أبت لا تعبد الشيطان إن الشيطان كان للرحمن عصيا
en: "O my father! Worship not Shaitan (Satan). Verily Shaitan (Satan) has been a rebel against the Most Gracious (Allah).

source: يا أبت إني أخاف أن يمسك عذاب من الرحمن فتكون للشيطان وليا
en: "O my father! Verily I fear lest a torment from the Most Gracious (Allah) should overtake you, so that you become a companion of Shaitan (Satan) (in the Hell-fire)." [Tafsir Al-Qurtubi]

source: قال أراغب أنت عن آلهتي يا إبراهيم لئن لم تنته لأرجمنك واهجرني مليا
en: He (the father) said: "Do you reject my gods, O Ibrahim (Abraham)? If you stop not (this), I will indeed stone you. So get away from me safely (before I punish you)."

source: قال سلام عليك سأستغفر لك ربي إنه كان بي حفيا
en: Ibrahim (Abraham) said: "Peace be on you! I will ask Forgiveness of my Lord for you. Verily He is unto me Ever Most Gracious.

source: وأعتزلكم وما تدعون من دون الله وأدعو ربي عسى ألا أكون بدعاء ربي شقيا
en: "And I shall turn away from you and from those whom you invoke besides Allah. And I shall call upon my Lord and I hope that I shall not be unblest in my invocation to my Lord."

source: فلما اعتزلهم وما يعبدون من دون الله وهبنا له إسحاق ويعقوب وكلا جعلنا نبيا
en: So when he had turned away from them and from those whom they worshipped besides Allah, We gave him Ishaq (Isaac) and Ya'qub (Jacob), and each one of them We made a Prophet.

source: ووهبنا لهم من رحمتنا وجعلنا لهم لسان صدق عليا
en: And We gave them of Our Mercy (a good provision in plenty), and We granted them honour on the tongues (of all the nations, i.e. everybody remembers them with a good praise).

source: واذكر في الكتاب موسى إنه كان مخلصا وكان رسولا نبيا
en: And mention in the Book (this Qur'an) Musa (Moses). Verily he was chosen and he was a Messenger (and) a Prophet.

source: وناديناه من جانب الطور الأيمن وقربناه نجيا
en: And We called him from the right side of the Mount, and made him draw near to Us for a talk with him [Musa (Moses)].

source: ووهبنا له من رحمتنا أخاه هارون نبيا
en: And We granted him his brother Harun (Aaron), (also) a Prophet, out of Our Mercy.

source: واذكر في الكتاب إسماعيل إنه كان صادق الوعد وكان رسولا نبيا
en: And mention in the Book (the Qur'an) Isma'il (Ishmael). Verily he was true to what he promised, and he was a Messenger, (and) a Prophet.

source: وكان يأمر أهله بالصلاة والزكاة وكان عند ربه مرضيا
en: And he used to enjoin on his family and his people As-Salat (the prayers) and the Zakat and his Lord was pleased with him.

source: واذكر في الكتاب إدريس إنه كان صديقا نبيا
en: And mention in the Book (the Qur'an) Idris (Enoch).Verily he was a man of truth, (and) a Prophet.

source: ورفعناه مكانا عليا
en: And We raised him to a high station.

source: أولئك الذين أنعم الله عليهم من النبيين من ذرية آدم وممن حملنا مع نوح ومن ذرية إبراهيم وإسرائيل وممن هدينا واجتبينا إذا تتلى عليهم آيات الرحمن خروا سجدا وبكيا
en: Those were they unto whom Allah bestowed His Grace from among the Prophets, of the offspring of Adam, and of those whom We carried (in the ship) with Nuh (Noah), and of the offspring of Ibrahim (Abraham) and Israel, and from among those whom We guided and chose. When the Verses of the Most Gracious (Allah) were recited unto them, they fell down prostrate and weeping.

source: فخلف من بعدهم خلف أضاعوا الصلاة واتبعوا الشهوات فسوف يلقون غيا
en: Then, there has succeeded them a posterity who have given up As-Salat (the prayers) [i.e. made their Salat (prayers) to be lost, either by not offering them or by not offering them perfectly or by not offering them in their proper fixed times] and have followed lusts. So they will be thrown in Hell.

source: إلا من تاب وآمن وعمل صالحا فأولئك يدخلون الجنة ولا يظلمون شيئا
en: Except those who repent and believe (in the Oneness of Allah and His Messenger Muhammad صلى الله عليه وسلم), and work righteousness. Such will enter Paradise and they will not be wronged in aught.

source: جنات عدن التي وعد الرحمن عباده بالغيب إنه كان وعده مأتيا
en: (They will enter) 'Adn (Eden) Paradise (everlasting Gardens), which the Most Gracious (Allah) has promised to His slaves in the Unseen: Verily His Promise must come to pass.

source: لا يسمعون فيها لغوا إلا سلاما ولهم رزقهم فيها بكرة وعشيا
en: They shall not hear therein (in Paradise) any Laghw (dirty, false, evil vain talk), but only Salam (salutations of peace). And they will have therein their sustenance, morning and afternoon. [See (V.40:55)].

source: تلك الجنة التي نورث من عبادنا من كان تقيا
en: Such is the Paradise which We shall give as an inheritance to those of Our slaves who have been Al-Muttaqun (the pious - See V.2:2).

source: وما نتنزل إلا بأمر ربك له ما بين أيدينا وما خلفنا وما بين ذلك وما كان ربك نسيا
en: And we (angels) descend not except by the Command of your Lord (O Muhammad صلى الله عليه وسلم). To Him belongs what is before us and what is behind us, and what is between those two; and your Lord is never forgetful -

source: رب السماوات والأرض وما بينهما فاعبده واصطبر لعبادته هل تعلم له سميا
en: Lord of the heavens and the earth, and all that is between them, so worship Him (Alone) and be constant and patient in His worship. Do you know of any who is similar to Him? (of course none is similar or co-equal or comparable to Him, and He has none as partner with Him). [There is nothing like Him and He is the All-Hearer, the All-Seer].

source: ويقول الإنسان أإذا ما مت لسوف أخرج حيا
en: And man (the disbeliever) says: "When I am dead, shall I then be raised up alive?"

source: أولا يذكر الإنسان أنا خلقناه من قبل ولم يك شيئا
en: Does not man remember that We created him before, while he was nothing?

source: فوربك لنحشرنهم والشياطين ثم لنحضرنهم حول جهنم جثيا
en: So by your Lord, surely, We shall gather them together, and (also) the Shayatin (devils) (with them), then We shall bring them round Hell on their knees.

source: ثم لننزعن من كل شيعة أيهم أشد على الرحمن عتيا
en: Then indeed We shall drag out from every sect all those who were worst in obstinate rebellion against the Most Gracious (Allah).

source: ثم لنحن أعلم بالذين هم أولى بها صليا
en: Then, verily, We know best those who are most worthy of being burnt therein.

source: وإن منكم إلا واردها كان على ربك حتما مقضيا
en: There is not one of you but will pass over it (Hell): this is with your Lord; a Decree which must be accomplished.

source: ثم ننجي الذين اتقوا ونذر الظالمين فيها جثيا
en: Then We shall save those who used to fear Allah and were dutiful to Him. And We shall leave the Zalimun (polytheists and wrongdoers) therein (humbled) to their knees (in Hell).

source: وإذا تتلى عليهم آياتنا بينات قال الذين كفروا للذين آمنوا أي الفريقين خير مقاما وأحسن نديا
en: And when Our Clear Verses are recited to them, those who disbelieve (the rich and strong among the pagans of Quraish who live a life of luxury) say to those who believe (the weak, poor companions of Prophet Muhammad صلى الله عليه وسلم who have a hard life): "Which of the two groups (i.e. believers or disbelievers) is best in (point of) position and as regards station (place of council for consultation)."

source: وكم أهلكنا قبلهم من قرن هم أحسن أثاثا ورئيا
en: And how many a generation (past nations) have We destroyed before them, who were better in wealth, goods and outward appearance?

source: قل من كان في الضلالة فليمدد له الرحمن مدا حتى إذا رأوا ما يوعدون إما العذاب وإما الساعة فسيعلمون من هو شر مكانا وأضعف جندا
en: Say (O Muhammad صلى الله عليه وسلم) whoever is in error, the Most Gracious (Allah) will extend (the rope) to him, until, when they see that which they were promised, either the torment or the Hour, they will come to know who is worst in position, and who is weaker in forces. [This is the answer to the question in Verse No.19:73]

source: ويزيد الله الذين اهتدوا هدى والباقيات الصالحات خير عند ربك ثوابا وخير مردا
en: And Allah increases in guidance those who walk aright. And the righteous good deeds that last, are better with your Lord, for reward and better for resort.

source: أفرأيت الذي كفر بآياتنا وقال لأوتين مالا وولدا
en: Have you seen him who disbelieved in Our Ayat (this Qur'an and Muhammad صلى الله عليه وسلم) and said: "I shall certainly be given wealth and children [if I will be alive (again)]."

source: أطلع الغيب أم اتخذ عند الرحمن عهدا
en: Has he known the Unseen or has he taken a covenant from the Most Gracious (Allah)?

source: كلا سنكتب ما يقول ونمد له من العذاب مدا
en: Nay, We shall record what he says, and We shall increase his torment (in the Hell);

source: ونرثه ما يقول ويأتينا فردا
en: And We shall inherit from him (at his death) all that he talks of (i.e. wealth and children which We have bestowed upon him in this world), and he shall come to Us alone.

source: واتخذوا من دون الله آلهة ليكونوا لهم عزا
en: And they have taken (for worship) alihah (gods) besides Allah, that they might give them honour, power and glory (and also protect them from Allah's punishment).

source: كلا سيكفرون بعبادتهم ويكونون عليهم ضدا
en: Nay, but they (the so-called gods) will deny their worship of them, and become opponents to them (on the Day of Resurrection).

source: ألم تر أنا أرسلنا الشياطين على الكافرين تؤزهم أزا
en: See you not that We have sent the Shayatin (devils) against the disbelievers to push them to do evil.

source: فلا تعجل عليهم إنما نعد لهم عدا
en: So make no haste against them; We only count out to them a (limited) number (of the days of the life of this world and delay their term so that they may increase in evil and sins).

source: يوم نحشر المتقين إلى الرحمن وفدا
en: The Day We shall gather the Muttaqun (the pious - See V.2:2) unto the Most Gracious (Allah), like a delegation (presented before a king for honour).

source: ونسوق المجرمين إلى جهنم وردا
en: And We shall drive the Mujrimun (polytheists, sinners, criminals, disbelievers in the Oneness of Allah) to Hell, in a thirsty state (like a thirsty herd driven down to water).

source: لا يملكون الشفاعة إلا من اتخذ عند الرحمن عهدا
en: None shall have the power of intercession, but such a one as has received permission (or promise) from the Most Gracious (Allah).

source: وقالوا اتخذ الرحمن ولدا
en: And they say: "The Most Gracious (Allah) has begotten a son (or offspring or children) [as the Jews say: 'Uzair (Ezra) is the son of Allah, and the Christians say that He has begotten a son ['Îsa (Jesus) عليه السلام], and the pagan Arabs say that He has begotten daughters (angels and others.)]."

source: لقد جئتم شيئا إدا
en: Indeed you have brought forth (said) a terrible evil thing.

source: تكاد السماوات يتفطرن منه وتنشق الأرض وتخر الجبال هدا
en: Whereby the heavens are almost torn, and the earth is split asunder, and the mountains fall in ruins,

source: أن دعوا للرحمن ولدا
en: That they ascribe a son (or offspring or children) to the Most Gracious (Allah).

source: وما ينبغي للرحمن أن يتخذ ولدا
en: But it is not suitable for (the Majesty of) the Most Gracious (Allah) that He should beget a son (or offspring or children).

source: إن كل من في السماوات والأرض إلا آتي الرحمن عبدا
en: There is none in the heavens and the earth but comes unto the Most Gracious (Allah) as a slave.

source: لقد أحصاهم وعدهم عدا
en: Verily He knows each one of them, and has counted them a full counting.

source: وكلهم آتيه يوم القيامة فردا
en: And everyone of them will come to Him alone on the Day of Resurrection (without any helper, or protector or defender).

source: إن الذين آمنوا وعملوا الصالحات سيجعل لهم الرحمن ودا
en: Verily, those who believe [in the Oneness of Allah and in His Messenger (Muhammad صلى الله عليه وسلم)] and work deeds of righteousness, the Most Gracious (Allah) will bestow love for them (in the hearts of the believers).

source: فإنما يسرناه بلسانك لتبشر به المتقين وتنذر به قوما لدا
en: So We have made this (the Qur'an) easy in your own tongue (O Muhammad صلى الله عليه وسلم), only that you may give glad tidings to the Muttaqun (the pious - See V.2:2), and warn with it the Ludd (most quarrelsome) people.

source: وكم أهلكنا قبلهم من قرن هل تحس منهم من أحد أو تسمع لهم ركزا
en: And how many a generation before them have We destroyed! Can you (O Muhammad صلى الله عليه وسلم) find a single one of them or hear even a whisper of them?

source: طه
en: Ta-Ha. [These letters are one of the miracles of the Qur'an, and none but Allah (Alone) knows their meanings].

source: ما أنزلنا عليك القرآن لتشقى
en: We have not sent down the Qur'an unto you (O Muhammad صلى الله عليه وسلم) to cause you distress,

source: إلا تذكرة لمن يخشى
en: But only as a Reminder to those who fear (Allah).

source: تنزيلا ممن خلق الأرض والسماوات العلى
en: A revelation from Him (Allah) Who has created the earth and high heavens.

source: الرحمن على العرش استوى
en: The Most Gracious (Allah) rose over (Istawa) the (Mighty) Throne (in a manner that suits His Majesty).

source: له ما في السماوات وما في الأرض وما بينهما وما تحت الثرى
en: To Him belongs all that is in the heavens and all that is on the earth, and all that is between them, and all that is under the soil.

source: وإن تجهر بالقول فإنه يعلم السر وأخفى
en: And if you (O Muhammad صلى الله عليه وسلم) speak (the invocation) aloud, then verily, He knows the secret and that which is yet more hidden.

source: الله لا إله إلا هو له الأسماء الحسنى
en: Allah! La ilaha illa Huwa (none has the right to be worshipped but He)! To Him belong the Best Names.

source: وهل أتاك حديث موسى
en: And has there come to you the story of Musa (Moses)?

source: إذ رأى نارا فقال لأهله امكثوا إني آنست نارا لعلي آتيكم منها بقبس أو أجد على النار هدى
en: When he saw a fire, he said to his family: "Wait! Verily, I have seen a fire; perhaps I can bring you some burning brand therefrom, or find some guidance at the fire."

source: فلما أتاها نودي يا موسى
en: And when he came to it (the fire), he was called by name: "O Musa (Moses)!

source: إني أنا ربك فاخلع نعليك إنك بالواد المقدس طوى
en: "Verily I am your Lord! So take off your shoes; you are in the sacred valley, Tuwa.

source: وأنا اخترتك فاستمع لما يوحى
en: "And I have chosen you. So listen to that which will be revealed (to you).

source: إنني أنا الله لا إله إلا أنا فاعبدني وأقم الصلاة لذكري
en: "Verily! I am Allah! La ilaha illa Ana (none has the right to be worshipped but I), so worship Me, and perform As-Salat (Iqamat-as-Salat) for My Remembrance.

source: إن الساعة آتية أكاد أخفيها لتجزى كل نفس بما تسعى
en: "Verily, the Hour is coming - and I am almost hiding it from Myself - that every person may be rewarded for that which he strives.

source: فلا يصدنك عنها من لا يؤمن بها واتبع هواه فتردى
en: "Therefore, let not the one who believes not therein (i.e. in the Day of Resurrection, Reckoning, Paradise and Hell.), but follows his own lusts, divert you therefrom, lest you perish.

source: وما تلك بيمينك يا موسى
en: "And what is that in your right hand, O Musa (Moses)?"

source: قال هي عصاي أتوكأ عليها وأهش بها على غنمي ولي فيها مآرب أخرى
en: He said: "This is my stick, whereon I lean, and wherewith I beat down branches for my sheep, and wherein I find other uses."

source: قال ألقها يا موسى
en: (Allah) said: "Cast it down, O Musa (Moses)!"

source: فألقاها فإذا هي حية تسعى
en: He cast it down, and behold! It was a snake, moving quickly.

source: قال خذها ولا تخف سنعيدها سيرتها الأولى
en: Allah said: "Grasp it and fear not; We shall return it to its former state,

source: واضمم يدك إلى جناحك تخرج بيضاء من غير سوء آية أخرى
en: "And press your (right) hand to your (left) side: it will come forth white (and shining), without any disease as another sign,

source: لنريك من آياتنا الكبرى
en: "That We may show you (some) of Our Greater Signs.

source: اذهب إلى فرعون إنه طغى
en: "Go to Fir'aun (Pharaoh)! Verily, he has transgressed (all bounds in disbelief and disobedience, and has behaved as an arrogant and as a tyrant)."

source: قال رب اشرح لي صدري
en: [Musa (Moses)] said: "O my Lord! Open for me my chest (grant me self-confidence, contentment, and boldness).

source: ويسر لي أمري
en: "And ease my task for me;

source: واحلل عقدة من لساني
en: "And loose the knot (the defect) from my tongue, (i.e. remove the incorrectness from my speech) [That occurred as a result of a brand of fire which Musa (Moses) put in his mouth when he was an infant]. (Tafsir At-Tabari).

source: يفقهوا قولي
en: "That they understand my speech.

source: واجعل لي وزيرا من أهلي
en: "And appoint for me a helper from my family,

source: هارون أخي
en: "Harun (Aaron), my brother.

source: اشدد به أزري
en: "Increase my strength with him,

source: وأشركه في أمري
en: "And let him share my task (of conveying Allah's Message and Prophethood),

source: كي نسبحك كثيرا
en: "That we may glorify You much,

source: ونذكرك كثيرا
en: "And remember You much,

source: إنك كنت بنا بصيرا
en: "Verily You are Ever a Well-Seer of us."

source: قال قد أوتيت سؤلك يا موسى
en: (Allah) said: "You are granted your request, O Musa (Moses)!

source: ولقد مننا عليك مرة أخرى
en: "And indeed We conferred a favour on you another time (before).

source: إذ أوحينا إلى أمك ما يوحى
en: "When We inspired your mother with that which We inspired.

source: أن اقذفيه في التابوت فاقذفيه في اليم فليلقه اليم بالساحل يأخذه عدو لي وعدو له وألقيت عليك محبة مني ولتصنع على عيني
en: "Saying: 'Put him (the child) into the Tabut (a box or a case or a chest) and put it into the river (Nile); then the river shall cast it up on the bank, and there, an enemy of Mine and an enemy of his shall take him.' And I endued you with love from Me, in order that you may be brought up under My Eye.
